## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/14505525561)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.docker_cache.google_artifact_registry_repository.artifact_registry
  * module.dockerhub_mirror.google_artifact_registry_repository.artifact_registry
* Delete
  * google_artifact_registry_repository.docker_cache
  * google_artifact_registry_repository.dockerhub_mirror



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.docker_cache will be destroyed
  # (because google_artifact_registry_repository.docker_cache is not in configuration)
  - resource "google_artifact_registry_repository" "docker_cache" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2022-10-11T11:19:45.542395Z" -> null
      - description            = "Cache repo for kyma-project" -> null
      - effective_labels       = {} -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/kyma-project/locations/europe/repositories/cache" -> null
      - labels                 = {} -> null
      - location               = "europe" -> null
      - mode                   = "STANDARD_REPOSITORY" -> null
      - name                   = "cache" -> null
      - project                = "kyma-project" -> null
      - repository_id          = "cache" -> null
      - terraform_labels       = {} -> null
      - update_time            = "2025-04-17T00:28:33.513441Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-untagged" -> null

          - condition {
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "UNTAGGED" -> null
              - version_name_prefixes = [] -> null
            }
        }
      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-old-cache" -> null

          - condition {
              - older_than            = "604800s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "ANY" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }
    }

  # google_artifact_registry_repository.dockerhub_mirror will be destroyed
  # (because google_artifact_registry_repository.dockerhub_mirror is not in configuration)
  - resource "google_artifact_registry_repository" "dockerhub_mirror" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2024-10-31T09:26:30.153692Z" -> null
      - description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md" -> null
      - effective_labels       = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror" -> null
      - labels                 = {} -> null
      - location               = "europe" -> null
      - mode                   = "REMOTE_REPOSITORY" -> null
      - name                   = "dockerhub-mirror" -> null
      - project                = "sap-kyma-prow" -> null
      - repository_id          = "dockerhub-mirror" -> null
      - terraform_labels       = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - update_time            = "2024-10-31T09:26:30.153692Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "cleanup-old-images" -> null

          - condition {
              - older_than            = "63072000s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "ANY" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - remote_repository_config {
          - description                 = "Mirror of Docker Hub" -> null
          - disable_upstream_validation = false -> null

          - docker_repository {
              - public_repository = "DOCKER_HUB" -> null
            }
        }
    }

  # module.docker_cache.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Cache repo for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "cache"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "cache"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "cache"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "cache"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-cache"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dockerhub-mirror"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dockerhub-mirror"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "cleanup-old-images"

          + condition {
              + older_than            = "63072000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }

      + remote_repository_config {
          + description = "Mirror of Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }

          + upstream_credentials {
              + username_password_credentials {
                  + password_secret_version = "projects/sap-kyma-prow/secrets/docker_sap_org_service_auth_token/versions/latest"
                  + username                = "sapcom"
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-04-16T06:49:21.867063Z" -> "2025-04-16T13:35:51.151680Z"
                # (18 unchanged attributes hidden)
            }
          + location                     = "europe"
          + repository_id                = "modules-internal"
        }
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2025-04-16T06:49:21.867063Z" -> "2025-04-16T13:35:51.151680Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":12929,"Program":"tfcmt","SHA1":"5bbc0fd2dfd4f06102080bcb2f27f4edbf5858f2","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->